app/views/bank_app/show.html.erb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "account_transactions".* FROM "account_transactions" WHERE "account_transactions"."client_id" = ?  [["client_id", 16]]
---
        <tbody>
          <%Current.client.account_transactions.each do |t|%>