app/helpers/transaction_helper.rb

INSERT INTO "account_transactions" ("amount", "transaction_type", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["amount", 2.0], ["transaction_type", "withdraw"], ["client_id", 16], ["created_at", "2023-12-12 16:12:26.495646"], ["updated_at", "2023-12-12 16:12:26.495646"]]
UPDATE "clients" SET "balance" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["balance", "110.0"], ["updated_at", "2023-12-12 16:06:09.080514"], ["id", 16]]
UPDATE "clients" SET "balance" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["balance", "2010.0"], ["updated_at", "2023-12-12 16:59:51.509105"], ["id", 16]]
---
	  def execute!
		if Current.client.blank?
		  @transaction_errors << "This account does not exist!"
		elsif @transaction_type == "withdraw" && Current.client.balance.to_f - @amount < 0.00
			@transaction_errors << "You do not have enough funds to complete this transaction!"
		elsif @amount < 0.00
			@transaction_errors << "Amount cannot be a negative number."
		else
		  ActiveRecord::Base.transaction do
			AccountTransaction.create!(
			  client: Current.client,
			  amount: @amount,
			  transaction_type: @transaction_type
			)

			if @transaction_type == "withdraw"
			  Current.client.update!(balance: Current.client.balance.to_f - @amount)
			elsif @transaction_type == "deposit"
			  Current.client.update!(balance: Current.client.balance.to_f + @amount)