app/controllers/application_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
	def set_current_client
		if session[:client_id]
			Current.client = Client.find_by(id: session[:client_id].to_i)