app/controllers/bank_app_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."username" = ? LIMIT ?  [["username", "rohia"], ["LIMIT", 1]]
---
  def create
    session_params = params.permit(:username, :password)
    @client = Client.find_by(username: session_params[:username])

    if @client.present? && @client.authenticate(session_params[:password])