app/controllers/registrations_controller.rb

	def create
		@client = Client.new(client_params)
		respond_to do |format|
		  if @client.save
---
INSERT INTO "clients" ("first_name", "last_name", "username", "balance", "account_number", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"